const Contents= {
    inputs : {
    img: '',
    gallTit:'',
    gallTxT:''
  },
datas : [
    {id: 1,
     img : "./restauant/0111113619490-4344d6513be34eeeae6d8e78829159b4.jpg",
     gallTit : "목포 자매집",
     gallTxT : "해남 출신의 네 자매가 운영하는 남도 음식 전문점. 해남에서 올라오는 자연산 재료를 사용한 남도식 반찬이 맛있다. 점심때는 짱뚱어탕이 유명하다."
    },
    {id : 2,
    img : "./restauant/0111120942226-9d7db25abc064036b11631022c7310f4.jpg",
    gallTit : "예당",
    gallTxT : "정갈한 한정식을 맛보고 싶은 분들이 즐겨 찾는 전통 한정식집. 편안한 분위기와 정성어린 서비스는 귀한 사람과 소중한 추억을 만들기에 안성맞춤. 예당은 한정식을 통해 느껴지는 푸짐한 인심과 풀 내음으로 기억된다."
   },
  {id : 3,
img : "./restauant/0112093030902-ab05e438bddc48a3bb9e9a97466e03c6.jpg",
  gallTit : "레트로오븐",
  gallTxT : "한적한 주택가에 있는 빵집으로, 빵 맛이 좋기로 유명한 곳이다. 많은 속 재료를 넣어 만들기보다는 치아바타나 올리브 빵 같이 빵 자체의 맛에 중점을 둔다. 부드러우면서 쫄깃하기도 해 식감이 뛰어나다. 오후가 되면 빵 대부분이 떨어지기 때문에 일찍 가거나 전화로 빵이 남았는지 문의한 후 가보는 것이 좋다."
 },
 {id : 4,
img : "./restauant/0112132533927-0ba3b683be534464b11b1a108c40f238.jpg",
 gallTit : "시실리",
 gallTxT : "커피 맛이 훌륭하기로 인정받고 있는 핸드 드립 커피 전문점. 몬순, 디카페인 등 생두를 볼 수 있으며 원두는 판매도 가능하다. 식사류로는 파스타도 즐길 수 있으며 샐러드, 빵, 커피가 같이 나온다. 실내 분위기는 클래식하면서 편안하다"
},
{id : 5,
img : "./restauant/0113104704297-734b67afa0664b569b00d6420ab5e64e.jpg",
gallTit : "손가네곰국수",
gallTxT : "한우 생불고기와 곰국수(사골 국물 칼국수)를 맛볼 수 있다. 이북식 왕만두도 인기 메뉴이다. 한옥 분위기에서 담백한 주요리와 정갈한 반찬을 맛볼 수 있어 찾는 사람들이 많다."
},
{id : 6,
img : "./restauant/0113105006484-46fa1c0ad4524ce0809bdb2075a2bde5.jpg",
gallTit : "쉐플로",
gallTxT : "서래마을에서 프렌치 퓨전으로 이름을 알린 키친 플로에서 새로 오픈한 프렌치 선술집. 프렌치 스타일의 음식과 더불어 일본 스타일의 음식도 만나볼 수 있다. 비교적 저렴한 분위기에서 가볍게 한잔하기에 좋은 곳이다."
},
{id : 7,
img : "./restauant/0113105557828-6e668b33fb2540d489cee732efeececa.jpg",
gallTit : "부산양곱창",
gallTxT : "비교적 저렴하게 곱창을 즐길 수 있다. 숯불구이라는 점이 장점이다. 마늘 양념 된 신선하고 오동통한 곱창이 괜찮다. 마무리로 먹는 양김치볶음밥이 저렴하면서도 환상적인 맛을 자랑한다. 곱창과 대창까지 푸짐하게 들어간 곱창전골도 인기가 있다."
},
{id : 8,
img : "./restauant/0113152911045-15cbf700be604d96b8b64a05d5e0f6fa.jpg",
gallTit : "벽제갈비 타워팰리스점",
gallTxT : "세계 최고의 맛 아시안 월스트리트 저널 신문에서 아시아 5대 음식점으로 선정, 세계 27대 대도시 대표 음식점 50선에 뽑힌 적도 있다. 맛있는 육즙을 가진 벽제 갈비의 설화한우를 맛볼 수 있다."
},
{id : 9,
img : "./restauant/0114133200968-cbf9842ff6c94df8984e8d170126a805.jpg",
gallTit : "홈수끼",
gallTxT : "태국의 수키와 일본의 샤부샤부를 혼합한 음식점이다. 코스 요리를 시키면 채소, 소고기 샤부샤부와 해물 죽을 즐길 수 있다. 샤부샤부를 먹은 후에는 칼국수와 죽을 끓여 먹는다. "
},
{id : 10,
img : "./restauant/0118152354350-eb73238dbc494ce393679124cb495f2b.jpg",
gallTit : "마복림 할머니 막내아들네",
gallTxT : "빨간 떡볶이의 원조 '신당동 떡볶이'를 만든 마복림 할머니의 며느리가 비법을 전수받아 운영하는 떡볶이 전문점이다. 신당동 떡볶이 타운 내에 위치하고 있다. 인기가 많아져 최근에는 택배 배송 서비스도 제공하고 있다."
},
{id : 11,
img : "./restauant/0120092716310-001a1527e8df4339ac49c79107ac8334.jpg",
gallTit : "일상",
gallTxT : "핸드 드립 커피전문점이다. 한쪽 벽면 가득한 국내외 책자들을 읽으면서 여유롭게 훌륭한 커피를 즐길 수 있는 곳이다. 커피에 대한 애정이 깊으신 사장님의 핸드 드립 커피 무료 특강도 있다."
},
{id : 12,
img : "./restauant/0120135426780-d27a23fa32de4084b772d3fc4e6fdd51.jpg",
gallTit : "슈치쿠",
gallTxT : "63빌딩 식당가를 레노베이션하면서 새로 오픈한 곳이다. 신선한 재료의 맛을 살린 스시와 사시미를 맛볼 수 있다. 58층에서 내려다보는 스시 카운터의 전망은 서울 최고라고도 할 수 있다."
},
{id : 13,
img : "./restauant/0118152354350-eb73238dbc494ce393679124cb495f2b.jpg",
gallTit : "마복림 할머니 막내아들네",
gallTxT : "빨간 떡볶이의 원조 '신당동 떡볶이'를 만든 마복림 할머니의 며느리가 비법을 전수받아 운영하는 떡볶이 전문점이다. 신당동 떡볶이 타운 내에 위치하고 있다. 인기가 많아져 최근에는 택배 배송 서비스도 제공하고 있다."
},
{id : 14,
img : "./restauant/0121120725648-a9c46645f2464d3d8d3cc74eddd344c6.jpg",
gallTit : "중국",
gallTxT : "자그마한 집이지만 짬뽕, 짜장면, 탕수육 등이 맛있는 집으로 소문났다."
},
{id : 15,
img : "./restauant/0121142143985-34280ad2f64945e0aa43e48fafd03c25.jpg",
gallTit : "트라토리아모로",
gallTxT : "그안의 셰프가 독립한 곳. 파스타 맛이 좋으며, 다양한 종류의 메인 요리도 준비되어 있다."
},
{id : 16,
img : "./restauant/201806071035509891.jpg",
gallTit : "스시 카이신",
gallTxT : "일본 긴자에서 접할 수 있는 작고 아담한 스타일의 고급 스시 전문점이다. 식자재 구매부터 손질, 접객에 이르기까지 일본인 오너셰프 혼자서 전 과정을 준비, 진행하여 항상 일정한 수준과 맛을 유지할 수 있도록 소규모로 카운터 총 6석의 카운터 석만을 운영한다. 1인부터 식사 가능하며, 소규모이므로 가능한 사전 예약을 추천한다. "
}]
}
const Reducer = (state, action)=>{
    switch(action.type){
        case 'create' :
            return{
                inputs : Contents.inputs,
                datas : state.datas.concat(action.data)
            }
        case 'delete' :
            return{
                ...state,
                datas:state.datas.filter((data)=>data.id !== action.id)
            }
        case 'updata' :
            return{
                ...state,
                datas: state.datas.map((data)=>data.id===action.id?
                    {...data,gallTit : action.gallTit,gallTxT : action.gallTxT} :data)
            }
            default :
            return state
    }
}

export {Contents, Reducer}