const subFesInfoDB = () => {
    let infoDB = [{
        tit: '경복궁 별빛야행',
        day: '2024년 4월3일 ~ 5월 4일(월, 화 휴무)',
        fesTime1: '1회 18:40 ~ 20:30',
        fesTime2: '2회 19:40 ~ 21:30',
        apply:'경복궁 민속박물관 앞 안내데스크',
        applyTime: '행사 시작 20분 전 시작',
        apply2: '*입장시간이 경과되면 입장에 제한이 있을 수 있으니, 시간 준수 부탁드립니다',
        tour:'음식 체험 및 야간 해설 탐방이 110분에 걸쳐 진행되며 내부관람도 포함되어 있으니 편한 신발과 겉옷을 준비해 주시기 바랍니다.',
        rain: '*행사 당일 오전 11시 기상청 예보 기준으로',
        infoTell: '궁능 프로그램 콜센터 1522 - 2295'
    },
    {
        tit: '경복궁 별빛야행',
        day: '2024년 4월3일 ~ 5월 4일(월, 화 휴무)',
        fesTime1: '1회 18:40 ~ 20:30',
        fesTime2: '2회 19:40 ~ 21:30',
        apply:'경복궁 민속박물관 앞 안내데스크',
        applyTime: '행사 시작 20분 전 시작',
        apply2: '*입장시간이 경과되면 입장에 제한이 있을 수 있으니, 시간 준수 부탁드립니다',
        tour:'음식 체험 및 야간 해설 탐방이 110분에 걸쳐 진행되며 내부관람도 포함되어 있으니 편한 신발과 겉옷을 준비해 주시기 바랍니다.',
        rain: '*행사 당일 오전 11시 기상청 예보 기준으로',
        infoTell: '궁능 프로그램 콜센터 1522 - 2295'
    }
]
}

const SubFesInfoCom = () =>{

    

    return(
        <></>
    )
}

export default SubFesInfoCom